#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.zip_python_code: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_event_rule.glue_job_creation_trigger will be created
  + resource "aws_cloudwatch_event_rule" "glue_job_creation_trigger" {
      + arn            = (known after apply)
      + description    = "Trigger Lambda when Glue job is created"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName   = [
                      + "JOB_CREATED",
                    ]
                  + eventSource = [
                      + "glue.amazonaws.com",
                    ]
                }
              + detail_type = [
                  + "Glue Job State Change",
                ]
              + source      = [
                  + "aws.glue",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "GlueJobCreationTriggerRule"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.glue_job_target will be created
  + resource "aws_cloudwatch_event_target" "glue_job_target" {
      + arn            = "arn:aws:iam::684710758112:role/LabRole"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "GlueJobCreationTriggerRule"
      + target_id      = "GlueJobLambdaTarget"
    }

  # aws_glue_job.glue_job will be created
  + resource "aws_glue_job" "glue_job" {
      + arn          = (known after apply)
      + description  = "This is script to convert dataset"
      + glue_version = "4.0"
      + id           = (known after apply)
      + max_capacity = (known after apply)
      + max_retries  = 1
      + name         = "group2"
      + role_arn     = "arn:aws:iam::684710758112:role/LabRole"
      + tags_all     = (known after apply)
      + timeout      = 2880

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://terraform-nikhil-prac/test.py"
        }

      + execution_property {
          + max_concurrent_runs = 2
        }
    }

  # aws_lambda_function.terraform_lambda_func will be created
  + resource "aws_lambda_function" "terraform_lambda_func" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lm-python.zip"
      + function_name                  = "Jhooq-Lambda-Function"
      + handler                        = "lm-python.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::684710758112:role/LabRole"
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @Nikhilpatil333, Action: `pull_request`*